In [0]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.0.3'

#### Introducing (Five?) New Datasets

In [0]:
# DATA URL SOURCES ###############################
eng_url     = 'https://andybek.com/pandas-eng'
state_url   = 'https://andybek.com/pandas-state'
party_url   = 'https://andybek.com/pandas-party'
liberal_url = 'https://andybek.com/pandas-liberal'
ivies_url   = 'https://andybek.com/pandas-ivies'
##################################################

In [0]:
eng = pd.read_csv(eng_url)

In [0]:
state = pd.read_csv(state_url)

In [6]:
state.head()

                                      School Name  ... Mid-Career Median Salary
0              University of California, Berkeley  ...             $112,000.00
1                    University of Virginia (UVA)  ...             $103,000.00
2                        Cal Poly San Luis Obispo  ...             $101,000.00
3  University of California at Los Angeles (UCLA)  ...             $101,000.00
4      University of California, San Diego (UCSD)  ...             $101,000.00

[5 rows x 4 columns]

In [0]:
party = pd.read_csv(party_url)

In [0]:
liberal = pd.read_csv(liberal_url)

In [0]:
ivies = pd.read_csv(ivies_url)

#### Concatenating DataFrames

In [0]:
dfs = [state, eng, liberal, ivies, party]

In [11]:
for df in dfs:
  print(df.shape)

(175, 4)
(19, 4)
(47, 4)
(8, 4)
(20, 4)

In [12]:
pd.concat([ivies, eng]).shape

(27, 4)

In [13]:
ivies.shape[0] + eng.shape[0]

27

In [14]:
pd.concat(dfs)

                                       School Name  ... Mid-Career Median Salary
0               University of California, Berkeley  ...             $112,000.00
1                     University of Virginia (UVA)  ...             $103,000.00
2                         Cal Poly San Luis Obispo  ...             $101,000.00
3   University of California at Los Angeles (UCLA)  ...             $101,000.00
4       University of California, San Diego (UCSD)  ...             $101,000.00
..                                             ...  ...                      ...
15               University of New Hampshire (UNH)  ...              $78,300.00
16                  West Virginia University (WVU)  ...              $78,100.00
17                         University of Tennessee  ...              $74,600.00
18                                 Ohio University  ...              $73,400.00
19                  Florida State University (FSU)  ...              $73,000.00

[269 rows x 4 columns]

In [15]:
set(party['School Name']).difference(state['School Name'])

{'Randolph-Macon College'}

In [16]:
'Randolph-Macon College' in liberal['School Name'].values

True

In [17]:
pd.concat(dfs)[pd.concat(dfs).duplicated(subset=['School Name'], keep='first')]

                                          School Name  ... Mid-Career Median Salary
0   University of Illinois at Urbana-Champaign (UIUC)  ...              $96,100.00
1                University of Maryland, College Park  ...              $95,000.00
2      University of California, Santa Barbara (UCSB)  ...              $95,000.00
3                   University of Texas (UT) - Austin  ...              $93,900.00
4       State University of New York (SUNY) at Albany  ...              $92,200.00
5                          University of Florida (UF)  ...              $87,900.00
6                    Louisiana State University (LSU)  ...              $87,800.00
7                         University of Georgia (UGA)  ...              $86,000.00
8                 Pennsylvania State University (PSU)  ...              $85,700.00
9                      Arizona State University (ASU)  ...              $84,100.00
10               Indiana University (IU), Bloomington  ...              $84,000.00
11                            University of Iowa (UI)  ...              $83,900.00
12                             Randolph-Macon College  ...              $83,600.00
13                  University of Alabama, Tuscaloosa  ...              $81,400.00
14                          University of Mississippi  ...              $79,700.00
15                  University of New Hampshire (UNH)  ...              $78,300.00
16                     West Virginia University (WVU)  ...              $78,100.00
17                            University of Tennessee  ...              $74,600.00
18                                    Ohio University  ...              $73,400.00
19                     Florida State University (FSU)  ...              $73,000.00

[20 rows x 4 columns]

In [0]:
schools = pd.concat(dfs).drop_duplicates(subset='School Name')

#### The Duplicated Index Issue

In [19]:
schools.loc[0]

                                   School Name  ... Mid-Career Median Salary
0           University of California, Berkeley  ...             $112,000.00
0  Massachusetts Institute of Technology (MIT)  ...             $126,000.00
0                          Bucknell University  ...             $110,000.00
0                            Dartmouth College  ...             $134,000.00

[4 rows x 4 columns]

In [0]:
# pd.concat() -> does not discard the original index of the dataframes being concatenated!

In [21]:
schools.index.duplicated()

array([False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True])

In [0]:
# in pandas, we could have duplicated indices!

In [0]:
# schools.loc[0:2] # does not work anymore

In [0]:
# the first fix

In [0]:
schools.reset_index(drop=True, inplace=True)

In [26]:
schools.index.duplicated().sum()

0

In [0]:
# the alternative approach: concat()

In [28]:
pd.concat(dfs, ignore_index=True).drop_duplicates(subset=['School Name']).index.duplicated().sum()

0

#### Enforcing Unique Indices

In [0]:
# Previously: df.reset_index(drop=True) OR pd.concat(ignore_index=True)

# GOAL: What if we wanted to preserve the index AND force uniqueness

In [30]:
ivies

                  School Name  ... Mid-Career Median Salary
0           Dartmouth College  ...             $134,000.00
1        Princeton University  ...             $131,000.00
2             Yale University  ...             $126,000.00
3          Harvard University  ...             $124,000.00
4  University of Pennsylvania  ...             $120,000.00
5          Cornell University  ...             $110,000.00
6            Brown University  ...             $109,000.00
7         Columbia University  ...             $107,000.00

[8 rows x 4 columns]

In [0]:
ivies2 = ivies.set_index('School Name')

In [0]:
eng2 = eng.set_index('School Name')

In [33]:
eng2.head()

                                              School Type  ... Mid-Career Median Salary
School Name                                                ...
Massachusetts Institute of Technology (MIT)   Engineering  ...             $126,000.00
California Institute of Technology (CIT)      Engineering  ...             $123,000.00
Harvey Mudd College                           Engineering  ...             $122,000.00
Polytechnic University of New York, Brooklyn  Engineering  ...             $114,000.00
Cooper Union                                  Engineering  ...             $114,000.00

[5 rows x 3 columns]

In [34]:
pd.concat([ivies2, eng2], ignore_index=True)

    School Type Starting Median Salary Mid-Career Median Salary
0    Ivy League            $58,000.00              $134,000.00
1    Ivy League            $66,500.00              $131,000.00
2    Ivy League            $59,100.00              $126,000.00
3    Ivy League            $63,400.00              $124,000.00
4    Ivy League            $60,900.00              $120,000.00
5    Ivy League            $60,300.00              $110,000.00
6    Ivy League            $56,200.00              $109,000.00
7    Ivy League            $59,400.00              $107,000.00
8   Engineering            $72,200.00              $126,000.00
9   Engineering            $75,500.00              $123,000.00
10  Engineering            $71,800.00              $122,000.00
11  Engineering            $62,400.00              $114,000.00
12  Engineering            $62,200.00              $114,000.00
13  Engineering            $61,000.00              $114,000.00
14  Engineering            $61,800.00              $111,000.00
15  Engineering            $61,100.00              $110,000.00
16  Engineering            $58,300.00              $106,000.00
17  Engineering            $58,100.00              $106,000.00
18  Engineering            $60,600.00              $105,000.00
19  Engineering            $56,000.00               $97,800.00
20  Engineering            $53,000.00               $96,700.00
21  Engineering            $53,500.00               $95,400.00
22  Engineering            $55,800.00               $93,400.00
23  Engineering            $51,000.00               $93,400.00
24  Engineering            $48,900.00               $84,600.00
25  Engineering            $52,700.00               $80,700.00
26  Engineering            $46,200.00               $80,000.00

In [35]:
pd.concat([ivies2, eng2], verify_integrity=True)

                                                    School Type  ... Mid-Career Median Salary
School Name                                                      ...
Dartmouth College                                    Ivy League  ...             $134,000.00
Princeton University                                 Ivy League  ...             $131,000.00
Yale University                                      Ivy League  ...             $126,000.00
Harvard University                                   Ivy League  ...             $124,000.00
University of Pennsylvania                           Ivy League  ...             $120,000.00
Cornell University                                   Ivy League  ...             $110,000.00
Brown University                                     Ivy League  ...             $109,000.00
Columbia University                                  Ivy League  ...             $107,000.00
Massachusetts Institute of Technology (MIT)         Engineering  ...             $126,000.00
California Institute of Technology (CIT)            Engineering  ...             $123,000.00
Harvey Mudd College                                 Engineering  ...             $122,000.00
Polytechnic University of New York, Brooklyn        Engineering  ...             $114,000.00
Cooper Union                                        Engineering  ...             $114,000.00
Worcester Polytechnic Institute (WPI)               Engineering  ...             $114,000.00
Carnegie Mellon University (CMU)                    Engineering  ...             $111,000.00
Rensselaer Polytechnic Institute (RPI)              Engineering  ...             $110,000.00
Georgia Institute of Technology                     Engineering  ...             $106,000.00
Colorado School of Mines                            Engineering  ...             $106,000.00
Stevens Institute of Technology                     Engineering  ...             $105,000.00
Illinois Institute of Technology (IIT)              Engineering  ...              $97,800.00
Wentworth Institute of Technology                   Engineering  ...              $96,700.00
Virginia Polytechnic Institute and State Univer...  Engineering  ...              $95,400.00
South Dakota School of Mines & Technology           Engineering  ...              $93,400.00
New Mexico Institute of Mining and Technology (...  Engineering  ...              $93,400.00
Rochester Institute of Technology (RIT)             Engineering  ...              $84,600.00
Embry-Riddle Aeronautical University (ERAU)         Engineering  ...              $80,700.00
Tennessee Technological University                  Engineering  ...              $80,000.00

[27 rows x 3 columns]

In [0]:
random_eng_school = eng2.sample()

In [37]:
random_eng_school

                                                    School Type  ... Mid-Career Median Salary
School Name                                                      ...
Virginia Polytechnic Institute and State Univer...  Engineering  ...              $95,400.00

[1 rows x 3 columns]

In [0]:
ivies2 = ivies2.append(random_eng_school)

In [0]:
# pd.concat([ivies2, eng2], verify_integrity=True)

#### BONUS - Creating Multiple Indicates With concat()

In [0]:
# Previously: pd.concat(ignore_index=True)

In [0]:
# How about a MultiIndex?

In [0]:
new_df = pd.concat([ivies, eng], keys=['ivyleague_schools', 'engineering_schools'])

In [43]:
type(new_df.index)

pandas.core.indexes.multi.MultiIndex

In [44]:
new_df.head()

                                    School Name  ... Mid-Career Median Salary
ivyleague_schools 0           Dartmouth College  ...             $134,000.00
                  1        Princeton University  ...             $131,000.00
                  2             Yale University  ...             $126,000.00
                  3          Harvard University  ...             $124,000.00
                  4  University of Pennsylvania  ...             $120,000.00

[5 rows x 4 columns]

In [45]:
new_df.loc[('ivyleague_schools', 3)]

School Name                 Harvard University
School Type                         Ivy League
Starting Median Salary             $63,400.00
Mid-Career Median Salary          $124,000.00
Name: (ivyleague_schools, 3), dtype: object

In [46]:
new_df.iloc[3]

School Name                 Harvard University
School Type                         Ivy League
Starting Median Salary             $63,400.00
Mid-Career Median Salary          $124,000.00
Name: (ivyleague_schools, 3), dtype: object

#### Column Axis Concatenation

In [0]:
#### previously:
# dfs = [state, eng, liberal, ivies, party]
# schools = pd.concat(dfs)

In [48]:
schools

                                        School Name  ... Mid-Career Median Salary
0                University of California, Berkeley  ...             $112,000.00
1                      University of Virginia (UVA)  ...             $103,000.00
2                          Cal Poly San Luis Obispo  ...             $101,000.00
3    University of California at Los Angeles (UCLA)  ...             $101,000.00
4        University of California, San Diego (UCSD)  ...             $101,000.00
..                                              ...  ...                      ...
244                              Harvard University  ...             $124,000.00
245                      University of Pennsylvania  ...             $120,000.00
246                              Cornell University  ...             $110,000.00
247                                Brown University  ...             $109,000.00
248                             Columbia University  ...             $107,000.00

[249 rows x 4 columns]

In [0]:
ivies3 = ivies.sort_values(by=['Starting Median Salary'], ascending=False)[:5].reset_index(drop=True)

In [0]:
eng3 = eng.sort_values(by=['Starting Median Salary'], ascending=False)[:5].reset_index(drop=True)

In [51]:
pd.concat([ivies3, eng3], axis=1)

                  School Name  ... Mid-Career Median Salary
0        Princeton University  ...             $123,000.00
1          Harvard University  ...             $126,000.00
2  University of Pennsylvania  ...             $122,000.00
3          Cornell University  ...             $114,000.00
4         Columbia University  ...             $114,000.00

[5 rows x 8 columns]

#### The append() Method: A Special Case Of concat()

In [52]:
liberal.append(party)

                          School Name  ... Mid-Career Median Salary
0                 Bucknell University  ...             $110,000.00
1                  Colgate University  ...             $108,000.00
2                     Amherst College  ...             $107,000.00
3                   Lafayette College  ...             $107,000.00
4                     Bowdoin College  ...             $107,000.00
..                                ...  ...                      ...
15  University of New Hampshire (UNH)  ...              $78,300.00
16     West Virginia University (WVU)  ...              $78,100.00
17            University of Tennessee  ...              $74,600.00
18                    Ohio University  ...              $73,400.00
19     Florida State University (FSU)  ...              $73,000.00

[67 rows x 4 columns]

In [53]:
pd.concat([liberal, party])

                          School Name  ... Mid-Career Median Salary
0                 Bucknell University  ...             $110,000.00
1                  Colgate University  ...             $108,000.00
2                     Amherst College  ...             $107,000.00
3                   Lafayette College  ...             $107,000.00
4                     Bowdoin College  ...             $107,000.00
..                                ...  ...                      ...
15  University of New Hampshire (UNH)  ...              $78,300.00
16     West Virginia University (WVU)  ...              $78,100.00
17            University of Tennessee  ...              $74,600.00
18                    Ohio University  ...              $73,400.00
19     Florida State University (FSU)  ...              $73,000.00

[67 rows x 4 columns]

#### Concat On Different Columns

In [54]:
ivies.head()

                  School Name  ... Mid-Career Median Salary
0           Dartmouth College  ...             $134,000.00
1        Princeton University  ...             $131,000.00
2             Yale University  ...             $126,000.00
3          Harvard University  ...             $124,000.00
4  University of Pennsylvania  ...             $120,000.00

[5 rows x 4 columns]

In [55]:
eng.head()

                                    School Name  ... Mid-Career Median Salary
0   Massachusetts Institute of Technology (MIT)  ...             $126,000.00
1      California Institute of Technology (CIT)  ...             $123,000.00
2                           Harvey Mudd College  ...             $122,000.00
3  Polytechnic University of New York, Brooklyn  ...             $114,000.00
4                                  Cooper Union  ...             $114,000.00

[5 rows x 4 columns]

In [0]:
# add STEM column

In [0]:
eng4 = eng.copy()

In [0]:
eng4['STEM'] = True

In [59]:
eng4.head()

                                    School Name  ...  STEM
0   Massachusetts Institute of Technology (MIT)  ...  True
1      California Institute of Technology (CIT)  ...  True
2                           Harvey Mudd College  ...  True
3  Polytechnic University of New York, Brooklyn  ...  True
4                                  Cooper Union  ...  True

[5 rows x 5 columns]

In [60]:
pd.concat([ivies, eng4], join='outer')

                                          School Name  ...  STEM
0                                   Dartmouth College  ...   NaN
1                                Princeton University  ...   NaN
2                                     Yale University  ...   NaN
3                                  Harvard University  ...   NaN
4                          University of Pennsylvania  ...   NaN
5                                  Cornell University  ...   NaN
6                                    Brown University  ...   NaN
7                                 Columbia University  ...   NaN
0         Massachusetts Institute of Technology (MIT)  ...  True
1            California Institute of Technology (CIT)  ...  True
2                                 Harvey Mudd College  ...  True
3        Polytechnic University of New York, Brooklyn  ...  True
4                                        Cooper Union  ...  True
5               Worcester Polytechnic Institute (WPI)  ...  True
6                    Carnegie Mellon University (CMU)  ...  True
7              Rensselaer Polytechnic Institute (RPI)  ...  True
8                     Georgia Institute of Technology  ...  True
9                            Colorado School of Mines  ...  True
10                    Stevens Institute of Technology  ...  True
11             Illinois Institute of Technology (IIT)  ...  True
12                  Wentworth Institute of Technology  ...  True
13  Virginia Polytechnic Institute and State Unive...  ...  True
14          South Dakota School of Mines & Technology  ...  True
15  New Mexico Institute of Mining and Technology ...  ...  True
16            Rochester Institute of Technology (RIT)  ...  True
17        Embry-Riddle Aeronautical University (ERAU)  ...  True
18                 Tennessee Technological University  ...  True

[27 rows x 5 columns]

In [61]:
pd.concat([ivies, eng4], join='inner')

                                          School Name  ... Mid-Career Median Salary
0                                   Dartmouth College  ...             $134,000.00
1                                Princeton University  ...             $131,000.00
2                                     Yale University  ...             $126,000.00
3                                  Harvard University  ...             $124,000.00
4                          University of Pennsylvania  ...             $120,000.00
5                                  Cornell University  ...             $110,000.00
6                                    Brown University  ...             $109,000.00
7                                 Columbia University  ...             $107,000.00
0         Massachusetts Institute of Technology (MIT)  ...             $126,000.00
1            California Institute of Technology (CIT)  ...             $123,000.00
2                                 Harvey Mudd College  ...             $122,000.00
3        Polytechnic University of New York, Brooklyn  ...             $114,000.00
4                                        Cooper Union  ...             $114,000.00
5               Worcester Polytechnic Institute (WPI)  ...             $114,000.00
6                    Carnegie Mellon University (CMU)  ...             $111,000.00
7              Rensselaer Polytechnic Institute (RPI)  ...             $110,000.00
8                     Georgia Institute of Technology  ...             $106,000.00
9                            Colorado School of Mines  ...             $106,000.00
10                    Stevens Institute of Technology  ...             $105,000.00
11             Illinois Institute of Technology (IIT)  ...              $97,800.00
12                  Wentworth Institute of Technology  ...              $96,700.00
13  Virginia Polytechnic Institute and State Unive...  ...              $95,400.00
14          South Dakota School of Mines & Technology  ...              $93,400.00
15  New Mexico Institute of Mining and Technology ...  ...              $93,400.00
16            Rochester Institute of Technology (RIT)  ...              $84,600.00
17        Embry-Riddle Aeronautical University (ERAU)  ...              $80,700.00
18                 Tennessee Technological University  ...              $80,000.00

[27 rows x 4 columns]

#### Skill Challenge

###### **1.**

Concatenate the *liberal* and *state* schools into a new dataframe. How many unique school names are there?

###### **2.**

What is the average median starting salary in the dataframe created above?

###### **3.**

Create a short dataframe that shows the top 3 *liberal* arts and *state* schools that produce the highest (mid-career) earning graduates. 

Show the *School Name* and *Mid-Career Median Salary* columns from each dataset, side by side, i.e. <ins>horizontally</ins>.

**BONUS**: nest the column labels within 'Liberal Arts' and 'State' labels.

#### Solution

In [0]:
# 1

In [0]:
dfc = pd.concat([liberal, state])

In [64]:
dfc.head()

           School Name  ... Mid-Career Median Salary
0  Bucknell University  ...             $110,000.00
1   Colgate University  ...             $108,000.00
2      Amherst College  ...             $107,000.00
3    Lafayette College  ...             $107,000.00
4      Bowdoin College  ...             $107,000.00

[5 rows x 4 columns]

In [65]:
dfc.nunique()

School Name                 222
School Type                   2
Starting Median Salary      122
Mid-Career Median Salary    155
dtype: int64

In [66]:
dfc['School Name'].nunique()

222

In [67]:
liberal.shape[0] + state.shape[0]

222

In [0]:
# 2

In [69]:
dfc.head()

           School Name  ... Mid-Career Median Salary
0  Bucknell University  ...             $110,000.00
1   Colgate University  ...             $108,000.00
2      Amherst College  ...             $107,000.00
3    Lafayette College  ...             $107,000.00
4      Bowdoin College  ...             $107,000.00

[5 rows x 4 columns]

In [70]:
dfc.iloc[:, 3].replace(r'\$|,', '', regex=True).astype(float).mean()

80856.3063063063

In [0]:
# 3

In [0]:
lib2 = liberal.sort_values(by=['Mid-Career Median Salary'], ascending=False)\
       .iloc[:3, [0, 3]].reset_index(drop=True)

In [0]:
state2 = state.sort_values(by=['Mid-Career Median Salary'], ascending=False)\
       .iloc[:3, [0, 3]].reset_index(drop=True)

In [74]:
pd.concat([lib2, state2], axis=1, keys=['Liberal Arts', 'State'])

                                    Liberal Arts  ...                    State
                                     School Name  ... Mid-Career Median Salary
0  Wesleyan University (Middletown, Connecticut)  ...              $99,600.00
1                                  Bates College  ...              $97,600.00
2                                  Union College  ...              $96,700.00

[3 rows x 4 columns]

#### The merge() Method

In [0]:
# merge() is similar to SQL!

In [0]:
# regional information on the schools

In [0]:
regions_url = 'https://andybek.com/pandas-regions'

In [0]:
regions = pd.read_csv(regions_url)

In [79]:
regions.head()

                                    School Name        Region
0   Massachusetts Institute of Technology (MIT)  Northeastern
1      California Institute of Technology (CIT)    California
2                           Harvey Mudd College    California
3  Polytechnic University of New York, Brooklyn  Northeastern
4                                  Cooper Union  Northeastern

In [80]:
regions.shape

(269, 2)

In [81]:
schools.head()

                                      School Name  ... Mid-Career Median Salary
0              University of California, Berkeley  ...             $112,000.00
1                    University of Virginia (UVA)  ...             $103,000.00
2                        Cal Poly San Luis Obispo  ...             $101,000.00
3  University of California at Los Angeles (UCLA)  ...             $101,000.00
4      University of California, San Diego (UCSD)  ...             $101,000.00

[5 rows x 4 columns]

In [82]:
pd.merge(schools, regions)

                                        School Name  ...        Region
0                University of California, Berkeley  ...    California
1                      University of Virginia (UVA)  ...      Southern
2                          Cal Poly San Luis Obispo  ...    California
3    University of California at Los Angeles (UCLA)  ...    California
4        University of California, San Diego (UCSD)  ...    California
..                                              ...  ...           ...
264                              Harvard University  ...  Northeastern
265                      University of Pennsylvania  ...  Northeastern
266                              Cornell University  ...  Northeastern
267                                Brown University  ...  Northeastern
268                             Columbia University  ...  Northeastern

[269 rows x 5 columns]

In [83]:
pd.merge(schools, regions, on='School Name')

                                        School Name  ...        Region
0                University of California, Berkeley  ...    California
1                      University of Virginia (UVA)  ...      Southern
2                          Cal Poly San Luis Obispo  ...    California
3    University of California at Los Angeles (UCLA)  ...    California
4        University of California, San Diego (UCSD)  ...    California
..                                              ...  ...           ...
264                              Harvard University  ...  Northeastern
265                      University of Pennsylvania  ...  Northeastern
266                              Cornell University  ...  Northeastern
267                                Brown University  ...  Northeastern
268                             Columbia University  ...  Northeastern

[269 rows x 5 columns]

#### The left_on And right_on Params

In [0]:
income_url = 'https://andybek.com/pandas-mid'

In [0]:
mid_career = pd.read_csv(income_url)

In [86]:
mid_career.head()

                                    school_name  ... Mid-Career 90th Percentile Salary
0   Massachusetts Institute of Technology (MIT)  ...                      $220,000.00
1      California Institute of Technology (CIT)  ...                               NaN
2                           Harvey Mudd College  ...                               NaN
3  Polytechnic University of New York, Brooklyn  ...                      $190,000.00
4                                  Cooper Union  ...                               NaN

[5 rows x 5 columns]

In [87]:
schools.head()

                                      School Name  ... Mid-Career Median Salary
0              University of California, Berkeley  ...             $112,000.00
1                    University of Virginia (UVA)  ...             $103,000.00
2                        Cal Poly San Luis Obispo  ...             $101,000.00
3  University of California at Los Angeles (UCLA)  ...             $101,000.00
4      University of California, San Diego (UCSD)  ...             $101,000.00

[5 rows x 4 columns]

In [0]:
# pd.merge(schools, mid_career)

In [89]:
pd.merge(schools, mid_career, left_on='School Name', right_on='school_name')

                                        School Name  ... Mid-Career 90th Percentile Salary
0                University of California, Berkeley  ...                      $201,000.00
1                      University of Virginia (UVA)  ...                      $215,000.00
2                          Cal Poly San Luis Obispo  ...                      $178,000.00
3    University of California at Los Angeles (UCLA)  ...                      $193,000.00
4        University of California, San Diego (UCSD)  ...                      $177,000.00
..                                              ...  ...                               ...
264                              Harvard University  ...                      $288,000.00
265                      University of Pennsylvania  ...                      $282,000.00
266                              Cornell University  ...                      $210,000.00
267                                Brown University  ...                      $228,000.00
268                             Columbia University  ...                      $241,000.00

[269 rows x 9 columns]

In [90]:
pd.merge(schools, mid_career, left_on='School Name', right_on='school_name').drop('school_name', axis=1)

                                        School Name  ... Mid-Career 90th Percentile Salary
0                University of California, Berkeley  ...                      $201,000.00
1                      University of Virginia (UVA)  ...                      $215,000.00
2                          Cal Poly San Luis Obispo  ...                      $178,000.00
3    University of California at Los Angeles (UCLA)  ...                      $193,000.00
4        University of California, San Diego (UCSD)  ...                      $177,000.00
..                                              ...  ...                               ...
264                              Harvard University  ...                      $288,000.00
265                      University of Pennsylvania  ...                      $282,000.00
266                              Cornell University  ...                      $210,000.00
267                                Brown University  ...                      $228,000.00
268                             Columbia University  ...                      $241,000.00

[269 rows x 8 columns]

#### Inner vs Outer Joins

In [0]:
# the how param

In [92]:
pd.merge(ivies, regions, how='inner')

                  School Name  ...        Region
0           Dartmouth College  ...  Northeastern
1        Princeton University  ...  Northeastern
2             Yale University  ...  Northeastern
3          Harvard University  ...  Northeastern
4  University of Pennsylvania  ...  Northeastern
5          Cornell University  ...  Northeastern
6            Brown University  ...  Northeastern
7         Columbia University  ...  Northeastern

[8 rows x 5 columns]

In [93]:
regions.shape

(269, 2)

In [94]:
pd.merge(ivies, regions, how='outer')

                             School Name  ...        Region
0                      Dartmouth College  ...  Northeastern
1                   Princeton University  ...  Northeastern
2                        Yale University  ...  Northeastern
3                     Harvard University  ...  Northeastern
4             University of Pennsylvania  ...  Northeastern
..                                   ...  ...           ...
264         Austin Peay State University  ...      Southern
265           Pittsburg State University  ...    Midwestern
266             Southern Utah University  ...       Western
267  Montana State University - Billings  ...       Western
268         Black Hills State University  ...    Midwestern

[269 rows x 5 columns]

In [0]:
# ===ASIDE

In [0]:
a = {1,2,3}
b = {4,9,2}

In [97]:
a.union(b)

{1, 2, 3, 4, 9}

#### Left vs Right Joins

In [98]:
pd.merge(ivies, regions, how='left')

                  School Name  ...        Region
0           Dartmouth College  ...  Northeastern
1        Princeton University  ...  Northeastern
2             Yale University  ...  Northeastern
3          Harvard University  ...  Northeastern
4  University of Pennsylvania  ...  Northeastern
5          Cornell University  ...  Northeastern
6            Brown University  ...  Northeastern
7         Columbia University  ...  Northeastern

[8 rows x 5 columns]

In [99]:
pd.merge(ivies, regions, how='right')

                             School Name  ...        Region
0                      Dartmouth College  ...  Northeastern
1                   Princeton University  ...  Northeastern
2                        Yale University  ...  Northeastern
3                     Harvard University  ...  Northeastern
4             University of Pennsylvania  ...  Northeastern
..                                   ...  ...           ...
264         Austin Peay State University  ...      Southern
265           Pittsburg State University  ...    Midwestern
266             Southern Utah University  ...       Western
267  Montana State University - Billings  ...       Western
268         Black Hills State University  ...    Midwestern

[269 rows x 5 columns]

In [0]:
# these are equivalent, or the same:

In [0]:
# pd.merge(ivies, regions, how='left')

In [0]:
# pd.merge(regions, ivies, how='right')

#### One-to-One and One-to-Many Joins

In [0]:
# 1-1

In [104]:
ivies

                  School Name  ... Mid-Career Median Salary
0           Dartmouth College  ...             $134,000.00
1        Princeton University  ...             $131,000.00
2             Yale University  ...             $126,000.00
3          Harvard University  ...             $124,000.00
4  University of Pennsylvania  ...             $120,000.00
5          Cornell University  ...             $110,000.00
6            Brown University  ...             $109,000.00
7         Columbia University  ...             $107,000.00

[8 rows x 4 columns]

In [105]:
regions.head()

                                    School Name        Region
0   Massachusetts Institute of Technology (MIT)  Northeastern
1      California Institute of Technology (CIT)    California
2                           Harvey Mudd College    California
3  Polytechnic University of New York, Brooklyn  Northeastern
4                                  Cooper Union  Northeastern

In [106]:
regions[regions['School Name'].isin(ivies['School Name'])]

                   School Name        Region
86           Dartmouth College  Northeastern
87        Princeton University  Northeastern
88             Yale University  Northeastern
89          Harvard University  Northeastern
90  University of Pennsylvania  Northeastern
91          Cornell University  Northeastern
92            Brown University  Northeastern
93         Columbia University  Northeastern

In [107]:
pd.merge(ivies, regions, how='inner', on='School Name')

                  School Name  ...        Region
0           Dartmouth College  ...  Northeastern
1        Princeton University  ...  Northeastern
2             Yale University  ...  Northeastern
3          Harvard University  ...  Northeastern
4  University of Pennsylvania  ...  Northeastern
5          Cornell University  ...  Northeastern
6            Brown University  ...  Northeastern
7         Columbia University  ...  Northeastern

[8 rows x 5 columns]

In [0]:
# 1-M

In [109]:
state

                                        School Name  ... Mid-Career Median Salary
0                University of California, Berkeley  ...             $112,000.00
1                      University of Virginia (UVA)  ...             $103,000.00
2                          Cal Poly San Luis Obispo  ...             $101,000.00
3    University of California at Los Angeles (UCLA)  ...             $101,000.00
4        University of California, San Diego (UCSD)  ...             $101,000.00
..                                              ...  ...                      ...
170                    Austin Peay State University  ...              $59,200.00
171                      Pittsburg State University  ...              $58,200.00
172                        Southern Utah University  ...              $56,500.00
173             Montana State University - Billings  ...              $50,600.00
174                    Black Hills State University  ...              $43,900.00

[175 rows x 4 columns]

In [110]:
state['School Name'].is_unique

True

In [111]:
regions[regions['School Name'].isin(state['School Name'])]

                                           School Name        Region
19   University of Illinois at Urbana-Champaign (UIUC)    Midwestern
20                University of Maryland, College Park      Southern
21      University of California, Santa Barbara (UCSB)    California
22                   University of Texas (UT) - Austin      Southern
23       State University of New York (SUNY) at Albany  Northeastern
..                                                 ...           ...
264                       Austin Peay State University      Southern
265                         Pittsburg State University    Midwestern
266                           Southern Utah University       Western
267                Montana State University - Billings       Western
268                       Black Hills State University    Midwestern

[194 rows x 2 columns]

In [112]:
regions[regions['School Name'].isin(state['School Name'])].loc[:, 'School Name'].value_counts()

University of Texas (UT) - Austin                    2
West Virginia University (WVU)                       2
University of Tennessee                              2
University of Mississippi                            2
University of Illinois at Urbana-Champaign (UIUC)    2
                                                    ..
California State University (CSU), Chico             1
Montana State University - Billings                  1
University of Wisconsin (UW) - Eau Claire            1
University of Alaska, Anchorage                      1
University of Toledo                                 1
Name: School Name, Length: 175, dtype: int64

In [113]:
pd.merge(state, regions, how='inner', on='School Name').sort_values(by='School Name')

                           School Name  ...      Region
169       Appalachian State University  ...    Southern
58      Arizona State University (ASU)  ...     Western
57      Arizona State University (ASU)  ...     Western
184    Arkansas State University (ASU)  ...    Southern
48                   Auburn University  ...    Southern
..                                 ...  ...         ...
107     West Virginia University (WVU)  ...    Southern
108     West Virginia University (WVU)  ...    Southern
175        Western Carolina University  ...    Southern
131  Western Michigan University (WMU)  ...  Midwestern
122      Western Washington University  ...     Western

[194 rows x 5 columns]

In [114]:
pd.merge(state, regions, how='inner', on='School Name').sort_values(by='School Name').drop_duplicates()

                           School Name  ...      Region
169       Appalachian State University  ...    Southern
58      Arizona State University (ASU)  ...     Western
184    Arkansas State University (ASU)  ...    Southern
48                   Auburn University  ...    Southern
189       Austin Peay State University  ...    Southern
..                                 ...  ...         ...
117             Wayne State University  ...  Midwestern
107     West Virginia University (WVU)  ...    Southern
175        Western Carolina University  ...    Southern
131  Western Michigan University (WMU)  ...  Midwestern
122      Western Washington University  ...     Western

[175 rows x 5 columns]

In [115]:
pd.merge(state, regions.drop_duplicates())

                                        School Name  ...      Region
0                University of California, Berkeley  ...  California
1                      University of Virginia (UVA)  ...    Southern
2                          Cal Poly San Luis Obispo  ...  California
3    University of California at Los Angeles (UCLA)  ...  California
4        University of California, San Diego (UCSD)  ...  California
..                                              ...  ...         ...
170                    Austin Peay State University  ...    Southern
171                      Pittsburg State University  ...  Midwestern
172                        Southern Utah University  ...     Western
173             Montana State University - Billings  ...     Western
174                    Black Hills State University  ...  Midwestern

[175 rows x 5 columns]

#### Many-to-Many Joins

In [0]:
# survey data -> what is the prestige of an ivy or eng degree

In [0]:
survey = pd.DataFrame({
    'School Type': ['Ivy League','Ivy League', 'Engineering', 'Engineering'],
    'Prestige': ['High', 'Good', 'Good', 'Okay'],
    'Respondent': [1,2,3,4]
})

In [0]:
survey = survey.append(pd.Series({'School Type': 'Ivy League', 'Prestige': 'Very High', 'Respondent': 5}, name=4))

In [119]:
survey

   School Type   Prestige  Respondent
0   Ivy League       High           1
1   Ivy League       Good           2
2  Engineering       Good           3
3  Engineering       Okay           4
4   Ivy League  Very High           5

In [120]:
ivies

                  School Name  ... Mid-Career Median Salary
0           Dartmouth College  ...             $134,000.00
1        Princeton University  ...             $131,000.00
2             Yale University  ...             $126,000.00
3          Harvard University  ...             $124,000.00
4  University of Pennsylvania  ...             $120,000.00
5          Cornell University  ...             $110,000.00
6            Brown University  ...             $109,000.00
7         Columbia University  ...             $107,000.00

[8 rows x 4 columns]

In [121]:
pd.merge(ivies, survey)

                   School Name School Type  ...   Prestige Respondent
0            Dartmouth College  Ivy League  ...       High          1
1            Dartmouth College  Ivy League  ...       Good          2
2            Dartmouth College  Ivy League  ...  Very High          5
3         Princeton University  Ivy League  ...       High          1
4         Princeton University  Ivy League  ...       Good          2
5         Princeton University  Ivy League  ...  Very High          5
6              Yale University  Ivy League  ...       High          1
7              Yale University  Ivy League  ...       Good          2
8              Yale University  Ivy League  ...  Very High          5
9           Harvard University  Ivy League  ...       High          1
10          Harvard University  Ivy League  ...       Good          2
11          Harvard University  Ivy League  ...  Very High          5
12  University of Pennsylvania  Ivy League  ...       High          1
13  University of Pennsylvania  Ivy League  ...       Good          2
14  University of Pennsylvania  Ivy League  ...  Very High          5
15          Cornell University  Ivy League  ...       High          1
16          Cornell University  Ivy League  ...       Good          2
17          Cornell University  Ivy League  ...  Very High          5
18            Brown University  Ivy League  ...       High          1
19            Brown University  Ivy League  ...       Good          2
20            Brown University  Ivy League  ...  Very High          5
21         Columbia University  Ivy League  ...       High          1
22         Columbia University  Ivy League  ...       Good          2
23         Columbia University  Ivy League  ...  Very High          5

[24 rows x 6 columns]

In [122]:
survey

   School Type   Prestige  Respondent
0   Ivy League       High           1
1   Ivy League       Good           2
2  Engineering       Good           3
3  Engineering       Okay           4
4   Ivy League  Very High           5

In [123]:
pd.merge(ivies, survey)

                   School Name School Type  ...   Prestige Respondent
0            Dartmouth College  Ivy League  ...       High          1
1            Dartmouth College  Ivy League  ...       Good          2
2            Dartmouth College  Ivy League  ...  Very High          5
3         Princeton University  Ivy League  ...       High          1
4         Princeton University  Ivy League  ...       Good          2
5         Princeton University  Ivy League  ...  Very High          5
6              Yale University  Ivy League  ...       High          1
7              Yale University  Ivy League  ...       Good          2
8              Yale University  Ivy League  ...  Very High          5
9           Harvard University  Ivy League  ...       High          1
10          Harvard University  Ivy League  ...       Good          2
11          Harvard University  Ivy League  ...  Very High          5
12  University of Pennsylvania  Ivy League  ...       High          1
13  University of Pennsylvania  Ivy League  ...       Good          2
14  University of Pennsylvania  Ivy League  ...  Very High          5
15          Cornell University  Ivy League  ...       High          1
16          Cornell University  Ivy League  ...       Good          2
17          Cornell University  Ivy League  ...  Very High          5
18            Brown University  Ivy League  ...       High          1
19            Brown University  Ivy League  ...       Good          2
20            Brown University  Ivy League  ...  Very High          5
21         Columbia University  Ivy League  ...       High          1
22         Columbia University  Ivy League  ...       Good          2
23         Columbia University  Ivy League  ...  Very High          5

[24 rows x 6 columns]

#### Merging By Index

Column joins options:
 - automatic 
 - the *on* parameter
 - *left_on*, *right_on* params




How about merging **by index**?

In [0]:
ivies4 = ivies.set_index('School Name')

In [0]:
regions2 = regions.set_index('School Name')

In [126]:
ivies4.head()

                           School Type  ... Mid-Career Median Salary
School Name                             ...
Dartmouth College           Ivy League  ...             $134,000.00
Princeton University        Ivy League  ...             $131,000.00
Yale University             Ivy League  ...             $126,000.00
Harvard University          Ivy League  ...             $124,000.00
University of Pennsylvania  Ivy League  ...             $120,000.00

[5 rows x 3 columns]

In [127]:
regions2.head()

                                                    Region
School Name
Massachusetts Institute of Technology (MIT)   Northeastern
California Institute of Technology (CIT)        California
Harvey Mudd College                             California
Polytechnic University of New York, Brooklyn  Northeastern
Cooper Union                                  Northeastern

In [128]:
pd.merge(ivies4, regions2, left_index=True, right_index=True)

                           School Type  ...        Region
School Name                             ...
Brown University            Ivy League  ...  Northeastern
Columbia University         Ivy League  ...  Northeastern
Cornell University          Ivy League  ...  Northeastern
Dartmouth College           Ivy League  ...  Northeastern
Harvard University          Ivy League  ...  Northeastern
Princeton University        Ivy League  ...  Northeastern
University of Pennsylvania  Ivy League  ...  Northeastern
Yale University             Ivy League  ...  Northeastern

[8 rows x 4 columns]

In [0]:
# How about merging by index vs column?

In [130]:
regions.head()

                                    School Name        Region
0   Massachusetts Institute of Technology (MIT)  Northeastern
1      California Institute of Technology (CIT)    California
2                           Harvey Mudd College    California
3  Polytechnic University of New York, Brooklyn  Northeastern
4                                  Cooper Union  Northeastern

In [131]:
ivies4

                           School Type  ... Mid-Career Median Salary
School Name                             ...
Dartmouth College           Ivy League  ...             $134,000.00
Princeton University        Ivy League  ...             $131,000.00
Yale University             Ivy League  ...             $126,000.00
Harvard University          Ivy League  ...             $124,000.00
University of Pennsylvania  Ivy League  ...             $120,000.00
Cornell University          Ivy League  ...             $110,000.00
Brown University            Ivy League  ...             $109,000.00
Columbia University         Ivy League  ...             $107,000.00

[8 rows x 3 columns]

In [132]:
pd.merge(ivies4, regions, left_index=True, right_on='School Name')

   School Type Starting Median Salary  ...                 School Name        Region
86  Ivy League            $58,000.00   ...           Dartmouth College  Northeastern
87  Ivy League            $66,500.00   ...        Princeton University  Northeastern
88  Ivy League            $59,100.00   ...             Yale University  Northeastern
89  Ivy League            $63,400.00   ...          Harvard University  Northeastern
90  Ivy League            $60,900.00   ...  University of Pennsylvania  Northeastern
91  Ivy League            $60,300.00   ...          Cornell University  Northeastern
92  Ivy League            $56,200.00   ...            Brown University  Northeastern
93  Ivy League            $59,400.00   ...         Columbia University  Northeastern

[8 rows x 5 columns]

#### The join() Method

In [133]:
ivies4

                           School Type  ... Mid-Career Median Salary
School Name                             ...
Dartmouth College           Ivy League  ...             $134,000.00
Princeton University        Ivy League  ...             $131,000.00
Yale University             Ivy League  ...             $126,000.00
Harvard University          Ivy League  ...             $124,000.00
University of Pennsylvania  Ivy League  ...             $120,000.00
Cornell University          Ivy League  ...             $110,000.00
Brown University            Ivy League  ...             $109,000.00
Columbia University         Ivy League  ...             $107,000.00

[8 rows x 3 columns]

In [134]:
regions2.head()

                                                    Region
School Name
Massachusetts Institute of Technology (MIT)   Northeastern
California Institute of Technology (CIT)        California
Harvey Mudd College                             California
Polytechnic University of New York, Brooklyn  Northeastern
Cooper Union                                  Northeastern

In [135]:
ivies4.join(regions2)

                           School Type  ...        Region
School Name                             ...
Brown University            Ivy League  ...  Northeastern
Columbia University         Ivy League  ...  Northeastern
Cornell University          Ivy League  ...  Northeastern
Dartmouth College           Ivy League  ...  Northeastern
Harvard University          Ivy League  ...  Northeastern
Princeton University        Ivy League  ...  Northeastern
University of Pennsylvania  Ivy League  ...  Northeastern
Yale University             Ivy League  ...  Northeastern

[8 rows x 4 columns]

In [136]:
pd.merge(ivies4, regions2, right_index=True, left_index=True)

                           School Type  ...        Region
School Name                             ...
Brown University            Ivy League  ...  Northeastern
Columbia University         Ivy League  ...  Northeastern
Cornell University          Ivy League  ...  Northeastern
Dartmouth College           Ivy League  ...  Northeastern
Harvard University          Ivy League  ...  Northeastern
Princeton University        Ivy League  ...  Northeastern
University of Pennsylvania  Ivy League  ...  Northeastern
Yale University             Ivy League  ...  Northeastern

[8 rows x 4 columns]

In [137]:
ivies

                  School Name  ... Mid-Career Median Salary
0           Dartmouth College  ...             $134,000.00
1        Princeton University  ...             $131,000.00
2             Yale University  ...             $126,000.00
3          Harvard University  ...             $124,000.00
4  University of Pennsylvania  ...             $120,000.00
5          Cornell University  ...             $110,000.00
6            Brown University  ...             $109,000.00
7         Columbia University  ...             $107,000.00

[8 rows x 4 columns]

In [138]:
regions2.head()

                                                    Region
School Name
Massachusetts Institute of Technology (MIT)   Northeastern
California Institute of Technology (CIT)        California
Harvey Mudd College                             California
Polytechnic University of New York, Brooklyn  Northeastern
Cooper Union                                  Northeastern

In [139]:
ivies.join(regions2, on='School Name')

                  School Name  ...        Region
0           Dartmouth College  ...  Northeastern
1        Princeton University  ...  Northeastern
2             Yale University  ...  Northeastern
3          Harvard University  ...  Northeastern
4  University of Pennsylvania  ...  Northeastern
5          Cornell University  ...  Northeastern
6            Brown University  ...  Northeastern
7         Columbia University  ...  Northeastern

[8 rows x 5 columns]

#### Skill Challenge

###### **1.**

Merge *liberal* arts schools with *regions* and assign the resulting dataframe to *dfm*. What region has the highest number of liberal arts schools?

###### **2.**

Set *school_name* as the index of the *mid_career* dataframe. Do the operation inplace.

###### **3.**

Merge the *dfm* and *mid_career* dataframes. Is the join operation one-to-one?

#### Solution

In [0]:
# 1

In [0]:
dfm = pd.merge(liberal, regions)

In [143]:
dfm.head()

           School Name   School Type  ... Mid-Career Median Salary        Region
0  Bucknell University  Liberal Arts  ...             $110,000.00   Northeastern
1   Colgate University  Liberal Arts  ...             $108,000.00   Northeastern
2      Amherst College  Liberal Arts  ...             $107,000.00   Northeastern
3    Lafayette College  Liberal Arts  ...             $107,000.00   Northeastern
4      Bowdoin College  Liberal Arts  ...             $107,000.00   Northeastern

[5 rows x 5 columns]

In [144]:
dfm['School Type'].nunique()

1

In [145]:
dfm.Region.value_counts()

Northeastern    25
Midwestern       8
Western          7
Southern         5
California       3
Name: Region, dtype: int64

In [0]:
# 2

In [147]:
mid_career.head()

                                    school_name  ... Mid-Career 90th Percentile Salary
0   Massachusetts Institute of Technology (MIT)  ...                      $220,000.00
1      California Institute of Technology (CIT)  ...                               NaN
2                           Harvey Mudd College  ...                               NaN
3  Polytechnic University of New York, Brooklyn  ...                      $190,000.00
4                                  Cooper Union  ...                               NaN

[5 rows x 5 columns]

In [0]:
mid_career.set_index('school_name', inplace=True)

In [150]:
mid_career.head()

                                             Mid-Career 10th Percentile Salary  ... Mid-Career 90th Percentile Salary
school_name                                                                     ...
Massachusetts Institute of Technology (MIT)                        $76,800.00   ...                      $220,000.00
California Institute of Technology (CIT)                                   NaN  ...                               NaN
Harvey Mudd College                                                        NaN  ...                               NaN
Polytechnic University of New York, Brooklyn                       $66,800.00   ...                      $190,000.00
Cooper Union                                                               NaN  ...                               NaN

[5 rows x 4 columns]

In [0]:
# 3

In [152]:
dfm.head()

           School Name   School Type  ... Mid-Career Median Salary        Region
0  Bucknell University  Liberal Arts  ...             $110,000.00   Northeastern
1   Colgate University  Liberal Arts  ...             $108,000.00   Northeastern
2      Amherst College  Liberal Arts  ...             $107,000.00   Northeastern
3    Lafayette College  Liberal Arts  ...             $107,000.00   Northeastern
4      Bowdoin College  Liberal Arts  ...             $107,000.00   Northeastern

[5 rows x 5 columns]

In [153]:
pd.merge(mid_career, dfm, left_index=True, right_on='School Name')

   Mid-Career 10th Percentile Salary  ...        Region
28                               NaN  ...      Southern
29                               NaN  ...      Southern
28                               NaN  ...      Southern
29                               NaN  ...      Southern
0                        $62,800.00   ...  Northeastern
1                        $60,000.00   ...  Northeastern
2                                NaN  ...  Northeastern
3                        $70,600.00   ...  Northeastern
4                                NaN  ...  Northeastern
5                                NaN  ...  Northeastern
6                                NaN  ...    California
7                                NaN  ...      Southern
8                                NaN  ...  Northeastern
9                                NaN  ...      Southern
10                               NaN  ...    Midwestern
11                               NaN  ...  Northeastern
12                               NaN  ...    California
13                       $42,000.00   ...  Northeastern
14                               NaN  ...  Northeastern
15                       $48,700.00   ...  Northeastern
16                       $44,500.00   ...      Southern
17                               NaN  ...  Northeastern
18                               NaN  ...  Northeastern
19                               NaN  ...  Northeastern
20                               NaN  ...  Northeastern
21                       $49,500.00   ...    Midwestern
22                       $41,300.00   ...    Midwestern
23                               NaN  ...  Northeastern
24                               NaN  ...  Northeastern
25                       $38,700.00   ...  Northeastern
26                       $45,100.00   ...  Northeastern
27                               NaN  ...  Northeastern
30                               NaN  ...  Northeastern
31                               NaN  ...    Midwestern
32                               NaN  ...    Midwestern
33                       $48,900.00   ...       Western
34                               NaN  ...       Western
35                               NaN  ...       Western
36                               NaN  ...    Midwestern
37                               NaN  ...       Western
38                       $35,600.00   ...  Northeastern
39                               NaN  ...  Northeastern
40                               NaN  ...    Midwestern
41                               NaN  ...    Midwestern
42                               NaN  ...  Northeastern
43                               NaN  ...  Northeastern
44                       $38,200.00   ...       Western
45                               NaN  ...       Western
46                               NaN  ...    California
47                       $38,800.00   ...       Western

[50 rows x 9 columns]

In [0]:
# Is it 1-1

In [0]:
left_key = mid_career.index

In [0]:
right_key = dfm['School Name'] # liberal arts inner join regions

In [161]:
left_key[left_key.isin(right_key)].value_counts()

Randolph-Macon College                           2
Wittenberg University                            1
University of Puget Sound                        1
College of the Holy Cross                        1
Washington and Lee University                    1
Grinnell College                                 1
Skidmore College                                 1
Gustavus Adolphus College                        1
Occidental College                               1
Franklin and Marshall College                    1
Hamilton College                                 1
Lafayette College                                1
Bowdoin College                                  1
Pomona College                                   1
Oberlin College                                  1
Fort Lewis College                               1
Davidson College                                 1
Smith College                                    1
Reed College                                     1
Bucknell University                              1
Bates College                                    1
Colgate University                               1
Siena College                                    1
Ursinus College                                  1
University of Richmond                           1
Evergreen State College                          1
Wellesley College                                1
Middlebury College                               1
Juniata College                                  1
Union College                                    1
Mount Holyoke College                            1
Denison University                               1
Williams College                                 1
Colorado College (CC)                            1
Colby College                                    1
Whitman College                                  1
Lewis & Clark College                            1
Swarthmore College                               1
Moravian College                                 1
Wesleyan University (Middletown, Connecticut)    1
St. Olaf College                                 1
Gettysburg College                               1
Carleton College                                 1
Amherst College                                  1
DePauw University                                1
Thomas Aquinas College                           1
Vassar College                                   1
Name: school_name, dtype: int64